# Task-1

In [5]:
import pandas as pd

In [6]:
# 1. Create 3 list viz. productId, Product Name, Product Price with 5 elements each.Add this element to create a DataFrame.

a=[[111,'Biscuits',30],
   [222,'Coke',20],
   [333,'Maggie',60],
  [444,'Wafers',20],
  [555,'Bread',45]]
b=pd.DataFrame(a,columns=['ProductId','ProductName','ProductPrice'])
b

   ProductId ProductName  ProductPrice
0        111    Biscuits            30
1        222        Coke            20
2        333      Maggie            60
3        444      Wafers            20
4        555       Bread            45

In [7]:
# 2. Extract one by one column and display separately from above dataframe.

b['ProductId']

0    111
1    222
2    333
3    444
4    555
Name: ProductId, dtype: int64

In [8]:
b['ProductName']

0    Biscuits
1        Coke
2      Maggie
3      Wafers
4       Bread
Name: ProductName, dtype: object

In [9]:
b['ProductPrice']

0    30
1    20
2    60
3    20
4    45
Name: ProductPrice, dtype: int64

In [10]:
# 3. Display separately each and every row from an above dataframe. (use loc or iloc function)

b.loc[0]

ProductId            111
ProductName     Biscuits
ProductPrice          30
Name: 0, dtype: object

In [11]:
b.loc[1]

ProductId        222
ProductName     Coke
ProductPrice      20
Name: 1, dtype: object

In [12]:
b.loc[2]

ProductId          333
ProductName     Maggie
ProductPrice        60
Name: 2, dtype: object

In [13]:
b.loc[3]

ProductId          444
ProductName     Wafers
ProductPrice        20
Name: 3, dtype: object

In [14]:
b.loc[4]

ProductId         555
ProductName     Bread
ProductPrice       45
Name: 4, dtype: object

In [15]:
# 4. Display product name from 3 row using loc function.

b['ProductName'].loc[[0,1,2]]

0    Biscuits
1        Coke
2      Maggie
Name: ProductName, dtype: object

In [16]:
# 5. Display price located in 2 row using iloc function.

b['ProductPrice'].iloc[1]

20

In [17]:
# 6. Display 2nd to 4th row data excluding price.

b[['ProductId','ProductName']].loc[[2,3,4]]

   ProductId ProductName
2        333      Maggie
3        444      Wafers
4        555       Bread

In [18]:
# 7. Display 1 to 3rd row price data only.

b['ProductPrice'].loc[[1,2,3]]

1    20
2    60
3    20
Name: ProductPrice, dtype: int64

In [19]:
# 8. Change marks in python column to 41 for students who have scored less than 40.

fa=[['Aayushi',98,97,96],
    ['Kavya',34,54,35],
    ['Shriya',54,65,86],
    ['Ansh',65,66,87],
   ['Dev',23,64,74],
   ['Fenil',45,65,75],
   ['Asti',34,34,34],
    ['Ziya',43,53,23]]
fa=pd.DataFrame(fa,columns=['Name','DataScience','Python','Maths'])
fa

      Name  DataScience  Python  Maths
0  Aayushi           98      97     96
1    Kavya           34      54     35
2   Shriya           54      65     86
3     Ansh           65      66     87
4      Dev           23      64     74
5    Fenil           45      65     75
6     Asti           34      34     34
7     Ziya           43      53     23

In [20]:
marks=fa['Maths']<40
fa.loc[marks,'Maths']=41
fa

      Name  DataScience  Python  Maths
0  Aayushi           98      97     96
1    Kavya           34      54     41
2   Shriya           54      65     86
3     Ansh           65      66     87
4      Dev           23      64     74
5    Fenil           45      65     75
6     Asti           34      34     41
7     Ziya           43      53     41

In [21]:
# 9. Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100.

ab= (fa[['DataScience', 'Python', 'Maths']] + 2).clip(upper=100)
ab

   DataScience  Python  Maths
0          100      99     98
1           36      56     43
2           56      67     88
3           67      68     89
4           25      66     76
5           47      67     77
6           36      36     43
7           45      55     43

In [22]:
# 10. Display students who have scored more than 50 marks in python and more than 60 marks in DataScience.

score = fa[(fa['Python'] > 50) & (fa['DataScience'] > 60)]
score

      Name  DataScience  Python  Maths
0  Aayushi           98      97     96
3     Ansh           65      66     87

In [23]:
# 11. Display students records whose name starts with letter S.

name = fa[fa['Name'].str.startswith('S')]
name

     Name  DataScience  Python  Maths
2  Shriya           54      65     86

In [24]:
# 12. Display students records whose name ends with letter a.

nameend = fa[fa['Name'].str.endswith('a')]
nameend

     Name  DataScience  Python  Maths
1   Kavya           34      54     41
2  Shriya           54      65     86
7    Ziya           43      53     41

In [25]:
# 13. Calculate total and percentage for all the students.

fa['Total']=fa[['DataScience','Python','Maths']].sum(axis=1)
fa['Total']

0    291
1    129
2    205
3    218
4    161
5    185
6    109
7    137
Name: Total, dtype: int64

In [26]:
fa['Percentage']=fa['Total']/300*100
fa['Percentage']

0    97.000000
1    43.000000
2    68.333333
3    72.666667
4    53.666667
5    61.666667
6    36.333333
7    45.666667
Name: Percentage, dtype: float64

In [27]:
# 14. Calculate Status (PASS / FAIL) for the Students.

fa.apply(lambda row: 'PASS' if row['Percentage'] >= 40  else 'FAIL', axis=1)

0    PASS
1    PASS
2    PASS
3    PASS
4    PASS
5    PASS
6    FAIL
7    PASS
dtype: object

In [28]:
# 15. Calculate percentage based grade value (per>=90 then A-grade, per>=80 then B-grade,per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then Fgrade)

def grade(percentage):
    if percentage >= 90:
        return 'A'
    elif percentage >= 80:
        return 'B'
    elif percentage >= 70:
        return 'C'
    elif percentage >= 60:
        return 'D'
    elif percentage >= 50:
        return 'E'
    else:
        return 'F'
fa['Grade'] = fa['Percentage'].apply(grade)
fa

      Name  DataScience  Python  Maths  Total  Percentage Grade
0  Aayushi           98      97     96    291   97.000000     A
1    Kavya           34      54     41    129   43.000000     F
2   Shriya           54      65     86    205   68.333333     D
3     Ansh           65      66     87    218   72.666667     C
4      Dev           23      64     74    161   53.666667     E
5    Fenil           45      65     75    185   61.666667     D
6     Asti           34      34     41    109   36.333333     F
7     Ziya           43      53     41    137   45.666667     F

In [29]:
#16. Also calculate overall columns total, maximum, minimum and standard deviation for each numeric columns.Convert the above dataframe to excel, json and html.

columns=['DataScience','Python','Maths']

fa = pd.DataFrame(data=fa, columns=columns)

result = pd.DataFrame({
    'Totall': fa.sum(),              
    'Maximum': fa.max(),
    'Minimum': fa.min(),
    'Standard Deviation': fa.std(numeric_only=True)
})
result

             Totall  Maximum  Minimum  Standard Deviation
DataScience     396       98       23           23.476432
Python          498       97       34           17.693825
Maths           541       96       41           23.114235

In [30]:
# 17. Display meta-data for each column for the above dataframe.

fa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   DataScience  8 non-null      int64
 1   Python       8 non-null      int64
 2   Maths        8 non-null      int64
dtypes: int64(3)
memory usage: 320.0 bytes

In [31]:
# 18.Convert the above DataFrame to list within a dictionary

list_dict = fa.to_dict(orient='list')
list_dict

{'DataScience': [98, 34, 54, 65, 23, 45, 34, 43],
 'Python': [97, 54, 65, 66, 64, 65, 34, 53],
 'Maths': [96, 41, 86, 87, 74, 75, 41, 41]}

In [32]:
# 19. Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column

a=[[111,'Biscuits',30],
   [222,'Coke',20],
   [333,'Maggie',60],
  [444,'Wafers',20],
  [555,'Bread',45]]
b=pd.DataFrame(a,columns=['ProductId','ProductName','ProductPrice'])

b['ProductPrice'] += 500
b

   ProductId ProductName  ProductPrice
0        111    Biscuits           530
1        222        Coke           520
2        333      Maggie           560
3        444      Wafers           520
4        555       Bread           545

# Task-2

In [33]:
# 1. Import pandas as pd.

import pandas as pd

In [34]:
# 2. Read Salaries.csv as a dataframe called sal.

sal = pd.read_csv('Salaries.csv')
sal

C:\Users\AAYUSH\AppData\Local\Temp\ipykernel_15132\2674976025.py:3: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [35]:
# 3. Check the head of the DataFrame.

sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [36]:
# 4. Use the .info() method to find out how many entries there are.

sal['BasePay'] = pd.to_numeric(sal['BasePay'], errors='coerce').astype(float)
sal['OvertimePay'] = pd.to_numeric(sal['OvertimePay'], errors='coerce').astype(float)
sal['OtherPay'] = pd.to_numeric(sal['OtherPay'], errors='coerce').astype(float)
sal['Benefits'] = pd.to_numeric(sal['Benefits'], errors='coerce').astype(float)
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [37]:
# 5. What is the average BasePay ?

avg_basepay = sal['BasePay'].mean()
avg_basepay

66325.44884050643

In [38]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [39]:
# 6. What is the highest amount of OvertimePay in the dataset?

sal['OvertimePay'].max()

245131.88

In [40]:
# 7. What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [41]:
# 8. How much does JOSEPH DRISCOLL make (including benefits)?

sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [42]:
# 9. What is the name of highest paid person (including benefits)?

sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [43]:
# 10. What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [44]:
# 11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

sal.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [45]:
# 12. How many unique job titles are there?

sal['JobTitle'].nunique()

2159

In [46]:
# 13. What are the top 5 most common jobs?

sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [47]:
# 14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

In [48]:
# 15. How many people have the word Chief in their job title?

sum(sal['JobTitle'].apply(lambda x: 'chief' in x.lower()))

627

In [49]:
# 16. Is there a correlation between length of the Job Title string and Salary?

sal['title_len'] = sal['JobTitle'].apply(len)

In [99]:
sal[['title_len','TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000